app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" DEFAULT VALUES